Autodesk.Revit.DB.Structure.StructuralConnectionSettings.GetStructuralConnectionSettings(Autodesk.Revit.DB.Document)
Obtains the StructuralConnectionSettings object for the specified project document.
document:
A project document.
Returns:
The StructuralConnectionSettings object.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.Structure.StructuralConnectionSettings.IncludeWarningControls
This property controls how Structural Connection Element is generated.
If set to true and warnings are reported for given Element, additional yellow triangle is displayed.
Since:
2017

Autodesk.Revit.DB.Structure.StructuralConnectionSettings
Provides access to project-wide structural connections settings.
Since:
2017